swagger/src/Catalogs/СхемыБезопасности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>СхемыБезопасности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_in</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>scheme</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>bearerFormat</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>flows</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>openIdConnectUrl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Catalogs/СхемыБезопасности/Ext/ObjectModule.bsl
Функция СформироватьJsonSwagger() Экспорт 
	Описание = Новый Соответствие;
	Описание.Вставить("type", ЭтотОбъект.type);
	
	Если ЗначениеЗаполнено(ЭтотОбъект._description) Тогда
		Описание.Вставить("description", ЭтотОбъект._description);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.name) Тогда
		Описание.Вставить("name", ЭтотОбъект.name);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект._in) Тогда
		Описание.Вставить("in", ЭтотОбъект._in);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.scheme) Тогда
		Описание.Вставить("scheme", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.scheme));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.flows) Тогда
		Описание.Вставить("flows", ОбщегоНазначенияSwagger.СформироватьОбъектаНаОснованииJSON(ЭтотОбъект.flows));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.bearerFormat) Тогда
		Описание.Вставить("bearerFormat", ЭтотОбъект.bearerFormat);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.openIdConnectUrl) Тогда
		Описание.Вставить("openIdConnectUrl", ЭтотОбъект.openIdConnectUrl);
	КонецЕсли;
	
	Возврат КоннекторHTTP.ОбъектВJson(Описание);
КонецФункции
